src/cfe/КСП/Catalogs/КСП_СвойстваМетодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_СвойстваМетодов</Name>
			<Comment>Методы, запускаемые через УправлениеЗаданиями, могут иметь настройки в этом справочнике</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараллельныхПроцессов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прерывание</Name>
					<Comment>флаг прерывания работы задания. используется для корректного завершения длительных процессов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Константы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/CommonModules/КСП_УправлениеЗаданиямиСлужебный/Ext/Module.bsl
#Область УсловияЗапуска

Функция ЕстьЗапретНаЗапускРегламентногоЗадания() Экспорт
		
	ЗначениеКонстанты = Ложь;
	
	Спр = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию("КСП_Планировщик");
	
	Если ЗначениеЗаполнено(Спр) Тогда
		ТЧ = Спр.Константы.Выгрузить();
		СтрокаТЧ =  ТЧ.Найти("Терминатор","Имя");
		Если СтрокаТЧ <> Неопределено Тогда
			Попытка
				ЗначениеКонстанты = СтрокаТЧ.Значение.Получить();
			Исключение
				ЗначениеКонстанты = Ложь;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеКонстанты) <> Тип("Булево") Тогда
		ЗначениеКонстанты = Ложь;
	КонецЕсли;
	
	Возврат ЗначениеКонстанты; // Истина запрещает запуск
	
КонецФункции

// Параметры
//	Флаг - булево - ИСТИНА - выключить регл задание, ЛОЖЬ - включить
//
Процедура УстановитьЗапретНаЗапускРегламентногоЗадания(Знач Флаг) Экспорт
	
	ТекущееЗначение = ЕстьЗапретНаЗапускРегламентногоЗадания();
	
	Если Флаг = ТекущееЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Спр = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию("КСП_Планировщик");
	
	Если ЗначениеЗаполнено(Спр) Тогда
		Для Каждого СтрокаТЧ Из Спр.Константы Цикл
			Если СтрокаТЧ.Имя = "Терминатор" Тогда
				Попытка
					СпрОбъект = Спр.ПолучитьОбъект();
				Исключение
					ЗаписьЖурналаРегистрации("КСП_Планировщик",УровеньЖурналаРегистрации.Ошибка,
						,Спр,"Изменение запрета не выполнено! Не удалось заблокировать элемент справочника КСП_СвойстваМетодов с наименованием 'КСП_Планировщик'! Подробности: "+ОписаниеОшибки());
					Возврат;
				КонецПопытки;
				СпрОбъект.Константы[СтрокаТЧ.НомерСтроки-1].Значение = Новый ХранилищеЗначения(Флаг);
				Попытка
					СпрОбъект.Записать();
				Исключение
					ЗаписьЖурналаРегистрации("КСП_Планировщик",УровеньЖурналаРегистрации.Ошибка,
						,Спр,"Изменение запрета не выполнено! Не удалось записать элемент справочника КСП_СвойстваМетодов с наименованием 'КСП_Планировщик'! Подробности: "+ОписаниеОшибки());
					Возврат;
				КонецПопытки;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
